[Killed] LogicalOperator
src/BMI.js:3:8
 function calculateBMI(heightInCM, weightInKG)
 {
-    if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
+    if((heightInCM === '' || heightInCM < 0) && isNaN(heightInCM)){
         return "Please provide a valid height"; 
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid height"
Received: "650000.00"

[Killed] BlockStatement
src/BMI.js:5:73
 {
     if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
-    } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
-        return"Please provide a valid weight";
-    } else {
+    } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){} else {
         return (weightInKG / ((heightInCM*heightInCM)/10000)).toFixed(2);
     }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid weight"
Received: undefined

[Killed] ConditionalExpression
src/BMI.js:5:16
 {
     if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
-    } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
+    } else if (false){
         return"Please provide a valid weight";
     } else {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid weight"
Received: "-0.39"
