[Killed] EqualityOperator
src/insertionSorting.js:3:25
 function insertionSort(arr) {
     let n = arr.length;
-        for (let i = 1; i < n; i++) {
+        for (let i = 1; i >= n; i++) {
             let current = arr[i];
             let j = i-1; 
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
+   45,
    12,

[Killed] ConditionalExpression
src/insertionSorting.js:6:33
         for (let i = 1; i < n; i++) {
             let current = arr[i];
             let j = i-1; 
-            while ((j > -1) && (current < arr[j])) {
+            while ((j > -1) && (true)) {
                 arr[j+1] = arr[j];
                 j--;
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
+   45,
    12,

[Survived] ArrayDeclaration
src/insertionSorting.js:15:27
     return arr;
 }
 
-console.log(insertionSort([2,1,4,3]))
+console.log(insertionSort([]))
 module.exports = {
     insertionSort
