[Killed] ConditionalExpression
src/selectionSorting.js:6:26
         
     for(let i = 0; i < n; i++) {
         let min = i;
-        for(let j = i+1; j < n; j++){
+        for(let j = i+1; false; j++){
             if(arr[j] < arr[min]) {
                 min=j; 
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
+   45,
    12,

[Killed] ArithmeticOperator
src/selectionSorting.js:6:21
         
     for(let i = 0; i < n; i++) {
         let min = i;
-        for(let j = i+1; j < n; j++){
+        for(let j = i - 1; j < n; j++){
             if(arr[j] < arr[min]) {
                 min=j; 
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   12,
+   78,

[Killed] ConditionalExpression
src/selectionSorting.js:7:16
     for(let i = 0; i < n; i++) {
         let min = i;
         for(let j = i+1; j < n; j++){
-            if(arr[j] < arr[min]) {
+            if(true) {
                 min=j; 
             }
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   12,
    23,

[Killed] ConditionalExpression
src/selectionSorting.js:11:14
                 min=j; 
             }
          }
-         if (min != i) {
+         if (false) {
              let tmp = arr[i]; 
              arr[i] = arr[min];
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
+   45,
    12,

[Survived] ArrayDeclaration
src/selectionSorting.js:19:27
     }
     return arr;
 }
-console.log(selectionSort([2,1,4,3]))
+console.log(selectionSort([]))
 module.exports = {
     selectionSort
